[
  {
    "id": "Splunk_AI_Research.pdf_0",
    "text": "An Introductory Use Case Guide Splunk Artificial Intelligence for Observability splunk> Table of contents Introduction............. ee 3 What are artificial intelligence (Al) and machine learning (ML)?....... Se 3 Why do organizations invest in artificial intellgence?............. Ce 3 Splunk Al portfolio... .........% Se Ce 4 Foundational elements for observability ... 2... .........000- Se 5 Considerations at the start of anAljourney.. 2.2... .....0.00- ee 5 Usecases............... ee Ce 9 1. Forecasting resource utilization. . . . . ee ee W 2. Detecting service performanceissues ................2048 ee 12 3. User experience monitoring. ©... 15 4.Noisereduction............. ee 7 5. Predicting data downtime inSplunk.. 2... ee ee be 18 6. Predictive maintenance... ...... Se See 19 7.Celltower monitoring. ........- Se Le 22 8.Geohazards monitoring... .. 2... ce Fe 23 Getstartedtoday......... Lee rn 24 Blogs... ee ee Ce be 24 Introduction This e-book is designed to help readers looking for ways to get value from implementing artificial intelligence (Al) or machine learning (ML) in Splunk, outlining example use cases that have been successfully implemented elsewhere. For each use case, the business challenge, approach to using Splunk and value will be presented. Additionally, each use case includes links to supporting information such as customer case studies or",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_1",
    "text": "documentation to help reproduce the use case in the Splunk environment. What are artificial intelligence (Al) and machine learning (ML)? The term “machine learning” is often used interchangeably with the term “artificial intelligence,” but ML is a subfield of Al. ML is a field of computer science that develops computer systems that can autonomously learn from experience by processing the data they receive and improving the performance of specific tasks. Artificial intelligence is the ability of a system to handle representations, both explicit and implicit, and to perform tasks that would be considered intelligent if performed by a human. Machine learning is the ability for computer systems to use algorithms and statistical models to continuously improve the performance of specific tasks. Deep learning is a specialized type of ML algorithm designed to mimic a human brain’s neural network, allowing machines to use massive amounts of data to learn from their own actions and improve future outcomes. An example of Deep Learning includes Large Language Models (LLMs) such as those used by ChatGPT. Why do organizations invest in artificial intelligence? The past few years have seen organizations have to cope with disruption on a global scale, with business resilience being tested",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_2",
    "text": "like never before. As noted in our Digital Resilience Pays Off report, being able to prepare for change is a key factor in building resilience and the ability to thrive during uncertain times. One subject that is often associated with change and innovation is ML. Specifically for observability, the ability to predict and prevent incidents before they occur is one of the key areas for driving value with ML; companies that can prevent downtime have much greater resilience than those who are reactive to downtime. Organizations that adopt ML and auto remediation across all their products and services are twice as likely (66%) to be prepared for the demands of arecession, compared to those that do not (34%). Splunk Artificial Intelligence for Observability | Splunk 3 Splunk Al portfolio Splunk provides a number of ways of utilizing Al/ML across the product portfolio. Broadly there are two ways of using Al/ML: using out-of-the-box features that are deeply integrated into existing product workflows, or through customization. ML is embedded into the Splunk platform within Splunk Cloud Platform and Splunk Enterprise, allowing users to: Detect anomalies, such as identifying outliers in the number of application errors. Generate forecasts, for example forecasting resource utilization.",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_3",
    "text": "Make predictions, like predicting potential outages. Cluster data into groups, for instance, clustering network activity to detect potentially misconfigured services. These techniques can be applied via assistants that guide the user through a series of steps to train, assess and operationalize ML models. Alternatively, ML-based analytics can be created directly using Splunk’s search language — Search Processing Language (SPL) — with a number of ML search commands embedded into core search and reporting, such as predict. The patterns tab in the search and reporting app also presents embedded machine learning to help identify groups of similar events in search results. In addition to the core platform, Splunk also provides ML-powered experiences in the following products: Out-of-the-box ML analytics in Enterprise Security, a market leading Security Incident and Event Management (SIEM) platform Pre-defined threat detection modeling in User Behaviour Analytics, designed to identify advanced persistent threats and insider threats Workflows in IT Service Intelligence — an AlOps solution —for creating adaptive thresholds for key metrics, as well as predicting potential outages Assistive wizards in Splunk Infrastructure Monitoring to detect outliers in metrics or predict when resource utilization thresholds will be crossed We also offer assistive intelligence experiences to provide personalized guidance.",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_4",
    "text": "The Splunk Al Assistant uses generative Al to provide a chat experience that helps users author and learn SPL by interacting in plain English and providing query suggestions, explanations and detailed breakdowns. The Splunk App for Anomaly Detection enables Splunk users to detect anomalies in their time series data sets and metrics using powerful machine learning algorithms in just a few clicks, while providing an end-to-end operationalization workflow to streamline creating and running anomaly detection jobs. The Splunk platform can be extended with add-ons that are designed specifically for running ML workloads, namely the Machine Learning Toolkit and the Splunk App for Data Science and Deep Learning. The Splunk Machine Learning Toolkit (MLTK) provides SPL commands, custom visualizations, assistants, and examples to explore a variety of ML concepts all inside the Splunk platform. Extending beyond MLTK, the Splunk App for Data Science and Deep Learning (DSDL) provides the ability to integrate advanced custom ML and deep learning systems with the Splunk platform. Security Observability Detect | Investigate | Respond Powered by Splunk Al Integrations | Models | Visualizations apis | Third-Party Tools Custom & Third-Party Manage | Search | Federate | Automate ‘Apps/ Services + ‘Events | Logs | Metrics",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_5",
    "text": "| Traces PublicClouds ‘ * Devices On-Prem Private Clouds . / Data Centers Splunk Artificial Intelligence for Observability | Splunk 4 Foundational elements for observability Observability is a modern approach to monitoring that provides complete visibility and context across the full stack of infrastructure, applications and the customer experience. In addition to Splunk receiving numerous TrustRadius awards for Event Analytics, GigaOm named Splunk a leader in cloud observability and Gartner listed Splunk as a leader in application performance monitoring (APM) and observability. Underpinning this success is the core data platform, which allows querying and visualizing log, metric and trace data in near realtime Observability’s goal of providing complete visibility and context across the full stack is underpinned by Splunk’s data schema, the Common Information Model (CIM). With the CIM machine generated data can be normalized across different data sources to provide a holistic view of activity. Additionally, data can be enriched with contextual information such as business unit information, asset data or configuration details. Getting data foundations right with the CIM and contextual enrichment is critical for advancing operational monitoring. AlOps (Artificial Intelligence for IT Operations) is a mature approach to Observability, incident management and response. Splunk’s AlOps solution —",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_6",
    "text": "IT Service Intelligence (ITS!) — has several areas that use ML: Adaptive Thresholding, used to generate baselines that describe typical key performance indicator (KPI) behavior; Anomaly Detection, used to identify unusual KPI readings; Predictive Analytics, used to predict future service health scores; and Smart Mode, used to automatically group related alerts. Monitoring complex systems beyond the scope and ability of a human is another strong use case of ML and one that is provided in Splunk Infrastructure Monitoring. Splunk Infrastructure Monitoring is designed to address real-time cloud monitoring requirements at scale, focusing on monitoring metrics and traces. A number of features use ML such as anomaly detection assistants, which provide a guided workflow to configure alerting based on metrics that have anomalous values. Additionally, alerts can be set up via an assistant for predicting when resources, such as disk space, will cross thresholds. Considerations at the start of an Al journey Before starting a new Al project, Splunk always recommends running a brief impact assessment to help prepare for success. At a minimum, the impact assessment scope should consider objectives, risk and execution capacity. Below are some main things to consider. Assess the objectives 87% of data science projects fail",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_7",
    "text": "to make it to production, highlighting the importance of defining clear outcomes to make an ML project successful. At a high level, these outcomes often fall into the following categories: + Increasing detection efficiency + Reducing manual processing or minimizing human error + Identifying previously unknown scenarios The most successful ML projects are often tied to granular outcomes, such as increasing detection accuracy by 70% for alerts related to application errors or reducing manual triage time for Network Operations Center (NOC) analysts by 50% when assessing alert storms. 1 https://venturebeat.com/ai/why-do-87-of-data-science-projects-never-make-it- into-production/ Splunk Artificial Intelligence for Observability | Splunk 5 When creating an ML Project, developing business outcomes and success metrics are important considerations. Typical questions to consider when determining an objective for an ML project are: Increasing detection efficiency a. Are current true positive and true negative rates known for existing detections? If so, are there understood business benefits from improving these rates, for example by improving detection accuracy analysts will not need to spend as much time triaging false positives. b. Are there certain alerts that trigger frequently, generating a lot of noise for the NOC? If so, improving the accuracy of these alerts could improve overall NOC efficiency.",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_8",
    "text": "c. Can target benchmarks be set to reduce false positives or improve alert accuracy? Reducing manual processing or minimizing human error a. Is there case management data available detailing the amount of time NOC analysts spend triaging alerts? This information can help identify alerts that could benefit from reduced triage times. b. Are there alerts that are ignored or closed in high volumes without triage? This may indicate situations where potential threats are being missed due to noisy alerts. c. Are there business objectives set for the amount of time analysts should spend improving NOC capabilities? Automating routine tasks to free up time for higher value activity is one mechanism for achieving this. Identifying previously unknown scenarios a. Have there been historic service incidents that were not identified by existing triggering alerts? b. Are there emerging technologies being adopted that are not well understood by the business? Assess the risk Guidance published by the World Economic Forum? notes that risks can be associated with using Al/ML techniques. Often, these risks are related to the difficulty of explaining the processing of data. Users of Al systems are often unsure how a particular output has been generated, which makes it difficult to",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_9",
    "text": "determine the correct action to take. Three areas that are important when considering risk of an Alsystem are: + Visibility: How much detail is required on how the data is being processed by an Al system? ML algorithms use complex mathematics when processing input data to generate an output, which can often make it difficult to understand why a particular output has been generated. + Control: What requirements for the hosting of data are in place in a given organization? In the public sector and in highly regulated industries many organizations have requirements to host certain types of data on authority infrastructure, making use of cloud services challenging. + Failure Tolerance: What will be the consequence of a failed Al project? Investment in Al is no guarantee for success, therefore consider how much flexibility there is in the business objectives and the downstream impact on the NOC team while working on the Al project. 2 https://www.weforum.org/reports/ai-procurement-in-a-box/ Splunk Artificial Intelligence for Observability | Splunk 6 The matrix below illustrates how some of the considerations about visibility and control of data might impact the choice of Splunk products (please refer to section A of Al Procurement in a Box Workbook® for further",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_10",
    "text": "questions to assess risk against visibility and control). Note that this is suggested guidance, and where appropriate, MLTK or an out-of-the-box use case may be preferable depending on risk appetite or the need for customization. Delivery Complexity ’ : Hosting: Hybrid Splunk The processing of Hosting: Splunk Cloud | | cicud and self-managed the data must be fully ML Processing: MI ML Processing: tl t ransparent Custom MLTK or DSDL Custom MLTK or DSDL Custoy ssing: Some of the key elements of the Hosting: Splunk Cloud processing must be ML Processing: MLTK explainable Hosting: self-managed ML ProCessing: MLTK ML Processing: MLTK Hosting: Hybrid Splunk We donot need to Hosting: Splun! Cloud and self-managed Hosting: self-managed know the details ML Processing: Out-of-the-box use cases ML Processing: Out-of-the-box use cases of how the datais processed use cases The data must be hosted on Some of the data can be hosted on external infrastructure The data can be hosted externally authority managed infrastructure se Control 3 https://www3.weforum.org/docs/WEF_AI_Procurement_in_a_Box_Workbook_2020.pdf Splunk Artificial Intelligence for Observability | Splunk 7 Assess execution capacity Provided a clear objective can be set for an ML project, the requirements for executing the project should also be evaluated. The list below is",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_11",
    "text": "not exhaustive or prescriptive, but presents some of the areas to think about before embarking onan experience with ML. People: a. Are subject matter experts on the data available to provide guidance on the meaning and quality of the data? b, What ML expertise is available to help develop and support these use cases in the future? c. If there is no ML expertise, can partners like Splunk provide the right resources to upskill or guide the project? d. Is there capacity in the NOC to handle additional workloads from the ML project? Process: a. Who willuse the analysis and how will they use it in their daily functions? b. How will the use case be operationalized? c. How will false positives be handled? d. Are clear next steps identified if the ML analytic identifies a true positive? Information: a. Is the data required for analysis already indexed in Splunk or are there plans in place for getting it indexed? . Are there any special handling requirements for the data, for example does personal data need to be obfuscated? . Are there blogs and content available about the use case on which the project is based? . Does the output",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_12",
    "text": "of the ML processing need to be explainable to a non- technical end user? Technology: a. Is ML necessary to solve the use case or can a correlation rule or basic statistics suffice? To determine this performance analysis comparing workloads to accuracy using different methodologies may be required, also looking at how users will consume the outputs. (Simpler methods are often more explainable.) . Will the current Splunk architecture need updating to handle special ML processing, such as introducing a dedicated search head for training ML models? Splunk Artificial Intelligence for Observability | Splunk 8 Use cases This section outlines introductory use cases for using ML for observability across information technology (IT) and operational technology (OT) domains. Each use case details the business challenge, Splunk’s approach to solving it and the value that can be realized from implementing the use case. Where available, links are included to case studies or additional information, such as MLTK docs pages, that can help with getting started implementing the use case in a Splunk environment. Although this document focuses on use cases, typically ML-based analytics in Splunk use one of three common techniques: anomaly detection, predictive analytics and clustering. Anomaly Detection Deviation from past",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_13",
    "text": "behaviors Resource utilization Error rate deviation Access pattern baselining Predictive Analytics A 5° 02.9 M6 4, 00 00 Future state prediction Predict storage requirements Identify patterns leading to failure Clustering Grouping based on behaviors Identify traffic Identify common behaviors Splunk Artificial Intelligence for Observability | Splunk The table below shows how the following use cases map to the different techniques. Use Case 1. Forecasting Resource Utilization Anomaly Detection Predictive Analytics Vv Clustering 2. Detecting Service Performance Issues Vv 3. User Experience Monitoring S 4. Noise Reduction 5, Predicting Data Downtime in Splunk 6. Predictive Maintenance 7.Cell Tower Monitoring 8. Geohazards Monitoring SIS ESUS Splunk Artificial Intelligence for Observability | Splunk 10 1. Forecasting resource utilization Business challenge According to some reports, roughly a quarter of incidents of downtime are caused by inadequate server hardware, compounded by half of incidents being affected by understaffed IT departments and the complexity of provisioning new services. Getting ahead of these types of incidents and reducing the workload on overburdened IT teams is an important factor in reducing downtime, but predicting resource utilization of complex IT systems is a challenge. Splunk’s approach With Splunk’s MLTK, users can create analytics for forecasting or predicting resource utilization",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_14",
    "text": "using a set of guided workflows or directly from the search bar. Additionally, alerts can be set in Splunk Infrastructure Monitoring for conditions like resources running out, based on predictions that use double exponential smoothing to forecast utilization. These predictions are generated based on a guided workflow, without the need for data science expertise to create the predictions. Value Increase detection efficiency: Being able to predict the overutilization of resources can help avoid potential outages. Reduce manual processing: Furthermore, helping IT teams get ahead of situations where resources will run too hot can improve efficiency, alerting teams to degradation ahead of labor intensive outages. 4 https://itic-corp.com/security-data-breaches-top-cause-of-downtime-in-2022/ Case studies and further information TransUnion As atrailblazer in predictive analytics in Splunk ITSI, TransUnion has been pushing the boundaries of what is possible when it comes to predicting resource utilization. TransUnion commonly faces disk space issues, with 30% of all database administrator (DBA) incidents related to disk space. In the past, the triage workflow took 20 minutes for a DBA to respond to a ticket, assess the issue, and then assign a ticket requesting a specific amount of additional space to the server storage if required. Using MLTK, they have reduced the triage",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_15",
    "text": "time by 65%, presenting the DBA team with a set of servers that are projected to run out of space within a month — the lead time for getting increased storage space provisioned. Read more about TransUnion’s experience forecasting resource utilization here, including a detailed set of searches for recreating their analytics. IKEA IKEA is another customer who has invested time using MLTK to determine potential database outages based on looking at the amount of free disk space. Initially creating experiments in MLTK, IKEA incorporated a successful technique into their Splunk ITS! workflows to simplify the experience for their end user analysts. The ability to augment Splunk ITSI KPIs, which operate at an aggregated entity level with per entity analytics using Splunk Enterprise, provided the granularity IKEA needed for certain use cases like predicting free disk space. Find out more about IKEA’s use of MLTK and Splunk ITSI here. Splunk Artificial Intelligence for Observability | Splunk 11 Business challenge Service outages can be costly, with our Digital Resilience Pays Off report finding that each hour of downtime can cost $365,000. Avoiding outages is therefore important for maintaining revenue, as well as for avoiding reputational damage. For companies who have complex",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_16",
    "text": "technology stacks, run many thousands of customer-facing applications, or have very high volumes of customers using their platforms, it can often be difficult to proactively spot outage conditions Splunk’s approach Indicators of a service outage can often come from metrics like the number of application error messages or network response times. Using Splunk’s Common Information Model these types of metrics can be normalized to provide consistency across different infrastructure, application, and cloud stacks. With Splunk ITSI, users can set up adaptive thresholds for KPIs like application error rates out-of-the-box by simply clicking through the Splunk ITSI user interface (Ul) to set up baseline thresholds for their applications. Splunk ITSI also has assistants that can run anomaly detection against KPIs like application error rates that will identify unusual error rates for a given application by looking at historic trends and patterns In addition to monitoring single KPls, Splunk ITSI also has features to train predictive models on services to predict future health scores. This allows the prediction of potential outages before they occur. 2. Detecting service performance issues Splunk Infrastructure Monitoring also provides a range of ML techniques for identifying unusual rates of metrics like session durations without having to be",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_17",
    "text": "a data scientist. Moreover, customers can create their own bespoke analytics for detecting unusual error message rates using MLTK, which contains multiple UI based assistants and algorithms for creating ML models. Value Increase detection efficiency: Uncovering application performance issues allows the user to get ahead of potential outages and prevent downtime. Furthermore, spotting periods of time where applications are showing signs of poor performance or degradation can prevent poor customer experiences — either by proactively reporting these issues to affected customers or addressing the cause of the issues before customers notice. Reduce manual processing: Programmatically identifying service or application behavior changes can reduce manual processing by operational analysts, minimizing the time they need to spend reviewing dashboards or running searches to spot a drift in behavior. Identify previously unknown scenarios: Creating baselines for service or application behavior can help uncover previously unknown service performance issues. Splunk Artificial Intelligence for Observability | Splunk 12 Case studies and further information IG Group The IG Group is a world leader in online trading, with access to over 17,000 markets and with over 200,000 active clients. To enable their online trading, they use over 1,500 web applications. Understanding the performance of these web applications",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_18",
    "text": "to ensure minimal downtime or service disruption is important for maintaining their reputation as a world leader as well as to reduce any financial damage. Historically, |G Group monitored these web applications using static thresholds, focussing mainly on three key RED metrics: rate, error rate, and duration. This method required manual assessment to determine the appropriate thresholds for these metrics, creating risks where setting thresholds too high would lead to missed outages or where setting thresholds too low would lead to alert fatigue from too much noise. In addition, the RED metrics would vary depending on the time of day or day of the week depending on the application being monitored, meaning static thresholds were not fit for round-the-clock monitoring, By using Splunk’s MLTK, IG Group was able to set up dynamic thresholds for its 4,500 web applications, becoming more effective at spotting potential outages. This took trial and error from IG Group to assess the best ML algorithm for providing scale and accuracy, a process supported by partnering with Splunk and the assistive workflows in MLTK. IG Group landed on a system of centralizing and normalizing the application RED metrics, doing some basic outlier detection using percentiles before training",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_19",
    "text": "a model that describes the baseline behavior of their applications. Applying that model to the normalized data as it is coming into Splunk allowed IG Group to build a set of alerts and reports for quickly identifying and triaging the anomalous applications, providing better accuracy and ultimately better service performance of their web apps. Read more about IG Groups’ use case here. Splunk Artificial Intelligence for Observability | Splunk 13 StubHub Another customer who has deployed a machine learning solution successfully for identifying unusual error rates is StubHub, a world leading online ticket marketplace for live events. Their application stack is incredibly complex, with many thousands of servers supporting distributed microservices with over 1000 endpoints. Troubleshooting this environment is incredibly complex, and they developed an ‘exception sniffer’ using Splunk’s MLTK to identify points in time when their stack was experiencing unusual volumes of errors. By normalizing their error data into a metrics index, StubHub created an optimized index for searching across their application error volumes. From this index, they developed a set of ML models to baseline the expected number of errors, using this model to identify in real-time any unusual volumes of errors. This reduced their exception logging by",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_20",
    "text": "50% and also uncovered several previously unknown application issues. Read more about StubHub’s use of machine learning here. TransUnion TransUnion is a consumer credit reporting agency, serving millions of consumers across the globe. In order to serve their customers, they run a number of big data platforms, with tens of thousands of data sources and multiple petabytes of data. The ability to understand how their environment is performing and avoid IT incidents is challenging in the face of such large volumes of data. TransUnion partnered with Splunk to implement a solution for predicting potential outages in Splunk ITSI. After working originally just with MLTK, they then delivered a solution that works with Splunk ITSI, which got incorporated in the product itself as ITSI Predictive Analytics! Read more about TransUnion’s experience with MLTK and Splunk ITSI here. Further information Online travel agency Priceline used ML to automatically detect application issues, reducing the manual triage in their NOC, with more information available here. Additionally, global service provider Accenture incorporated ML into their insights as a service platform for identifying issues with services, which can be read about here. Additionally, there is an MLTK deep dive designed to help users develop analytics for",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_21",
    "text": "identifying unusual volumes of error rates here. Another deep dive related to finding outliers in server response times can be found here. Provided all the correct apps are installed (namely MLTK, Python for Scientific Computing plus any technical add-ons required to structure your application data) and relevant data is in a Splunk instance, these how-to guides should take a few hours each to implement and test. Splunk Artificial Intelligence for Observability | Splunk 14 3. User experience monitoring Business challenge Investment in user experience can produce impressive returns; Forrester estimates that every $1 invested on improving user experience can realize a $100 return. Identifying the elements of the user journey that need the most improvement can be difficult with digital experiences often enabled by complex application stacks. The ability to baseline and understand these application stacks and their behaviors can provide valuable insights into the areas of the stack that could benefit from performance improvements. Splunk’s approach Splunk’s MLTK can be used to better understand user experience, for example, by identifying outliers in transaction times or by clustering clients based on their attributes to identify unusual patterns. 5 https://www forrester.com/report/The-Six-Steps-For-Justifying-Better-UX/RES117708 Value Improve detection efficiency: Using ML to baseline user experiences",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_22",
    "text": "can help identify areas of application stacks that would benefit the most from improvement Identify previously unknown scenarios: Furthermore, the ability to identify bottlenecks and issues in user experiences can improve the customer experience by identifying and responding to poor user experiences before customers report issues. Splunk Artificial Intelligence for Observability | Splunk 15 Case studies and further information Paychex Paychex is a provider of human capital management solutions serving hundreds of thousands of customers across the globe, processing the payments of one in twelve American private sector employees in 2019. Paychex was keen to ensure that the user experience provided to their customers is as seamless as possible, and used MLTK to gain insight into areas of their application stack that could benefit the most from improvement. Paychex used Splunk as the standard platform for correlating and searching across transaction data, and thus decided to use Splunk as the platform for running more advanced analytics on this type of data. By stitching together their transaction data in Splunk, Paychex was able to gain visibility into transaction durations from the UI all the way down to individual SQL queries. From these transaction durations, they used MLTK to help generate predictive",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_23",
    "text": "models to determine which user demographics had the most impact on transaction times, detect outliers in transaction times, and identify unique clients. Read more about the user experience monitoring use cases at Paychex here. BankID BanklD provides secure online identification and signing for financial transactions in Norway. Serving the majority of the population and running millions of transactions a day, BankID needed a way to aggregate and gain insight into billing transactions, particularly for newly introduced services. Deciding that Splunk was the platform to help them deliver this insight, BankID used MLTK to identify unusually long transaction times in their customers’ journeys, proactively identifying potential issues. To enable this analytic, they first used Splunk to generate a set of enriched transaction events, correlating across a number of data sources by transaction ID to retain a number of key fields, which were then enriched with contextual data from a lookup before being pushed into a summary index. From this summary index, BankID could easily visualize the steps in their transactions and automate the identification of outliers using MLTK. Find out more about BankID’s experience with MLTK here. Splunk Artificial Intelligence for Observability | Splunk 16 4. Noise reduction Business challenge With",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_24",
    "text": "a quarter of organizations reporting understaffed IT departments, ensuring that the workloads assigned to those teams are manageable is important. Monitoring IT systems can be a highly manual task, with some services often generating high volumes of alerts that can be overwhelming for analysts to triage, leading to missed signals amongst the noisy alerts. The ability to reduce the volumes of alerts and prioritize the most critical events can help reduce the burden on already overworked IT staff. Splunk’s approach Reducing noisy alerts can happen at many states of the event analytics pipeline, from suppressing alert generation by using smarter analytics (as described in many situations in the Detecting Service Performance Issues section) through to aggregating alerts into meaningful groups. With Splunk ITSI, customers can enable Smart Mode, which will automatically identify patterns in alerts to generate groupings, creating episodes of alerts that can be triaged as a single incident rather than going from alert to alert. 6 https://itic-corp.com/security-data-breaches-top-cause-of-downtime-in-2022/ Value Reduce manual processing: Reducing the number of alerts that an analyst has to triage can dramatically improve efficiency. Furthermore, IT operations teams can spot true incidents more easily when the risk of missing an incident is reduced by minimizing the",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_25",
    "text": "human error associated with sifting through massive volumes of alerts. Case studies and further information Further information Read about how Smart Mode works in Splunk ITSI here. Splunk Artificial Intelligence for Observability | Splunk 17 Business challenge Maintaining operational resilience becomes challenging when data feeds into monitoring tools such as Splunk are interrupted, reducing visibility into how services are performing, Data source owners do not generally grant full access to Splunk administrators, so identifying interrupted data feeds into Splunk is problematic. Furthermore, understanding how event feeds operate can be difficult when many thousands of hosts and many hundreds of data source types are being monitored, with each host and source type combination potentially having different behavior patterns. Splunk’s approach Splunk can collect data from most systems using forwarders, database connectors, or by using Data Manager (DM), for example. Once data has been collected for a period of time, ML models can be created to describe the expected number of events for a given host and source combination. The models continuously monitor the data feeds and detect anomalies when data streams start to deviate from the expected throughput. @® ef © Calculate error statistics between predicted and actual values Generate a",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_26",
    "text": "predictive model that estimates the volume of events per sourcetype Experimentation 5. Predicting data downtime in Splunk Identify anomalies from the error statistics Value Improve detection efficiency: By finding and addressing abnormalities during data ingestion (before an ingest pipeline gets disrupted or broken), data uptime can be maintained in Splunk. As Splunk is used for monitoring critical systems, maintaining data uptime will provide continued visibility of service issues or service degradation, helping to maintain operational resilience. Case studies and further information Further information There are a number of ways that anomaly detection can be used to monitor data input feeds into Splunk, but for a prescriptive approach to setting up these monitoring capabilities, Splunk has an in-depth webinar that walks through how to implement data feed anomaly detection here. Furthermore, Splunk also has a step-by-step deep dive on how this can be implemented, including sample xml for creating an anomaly detection dashboard here. This deep dive should take a few hours to implement from end-to-end. Schedule the periodic re-training of the predictive model and anomaly detection searches Create an anomaly detection dashboard and/or alert Productionization Splunk Artificial Intelligence for Observability | Splunk 18 6. Predictive maintenance Business challenge The cost",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_27",
    "text": "of downtime in manufacturing can be high, with some estimates putting the cost of downtime at over $250,000 an hour’ with additional costs associated with the cost of poor quality outputs. Therefore, the ability to predict when to run maintenance on critical production equipment before it breaks can avoid downtime and avoid producing bad quality products. Generating baseline behavior for manufacturing systems can be difficult due to equipment lifespans of over 10 years, or equipment being complex, and often bespoke. Splunk’s approach Splunk's MLTK allows users to develop predictive models on OT data through a series of guided workflows or directly using search. Additionally, OT metrics can be baselined using anomaly detection algorithms to help understand what normal looks like. DSDL can also be used to develop more sophisticated analytics on top of OT data, taking advantage of cutting edge ML libraries such as TensorFlow or PyTorch to better identify patterns in complex OT data feeds. 7 https://wwwaiot-world.com/predictive-analytics/predictive-maintenance/ the-actual-cost-of-downtime-in-the-manufacturing-industry/ Value Improve detection efficiency: Predictive analytics can help reduce unplanned maintenance activities by prompting engineers to fine tune systems before outages occur. Moreover, using predictive analytics can contribute to increased availability of production systems and reduced operating costs. If using Splunk",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_28",
    "text": "for predictive maintenance, much of the OT data collected can help improve security posture as well Additionally, predictive analytics on the products that are being manufactured can improve the quality of the output, reducing manufacturing costs and potential recall costs. Splunk Artificial Intelligence for Observability | Splunk 19 Case studies and further information BMW BMW already applied a high degree of planned and reactive testing to vehicles during the production process, but by building a predictive testing model using DSDL, BMW has been able to predict potential issues that might have been missed by a human operator. What? List of possible Dynamic ~” Where? error patterns Q-Gate . n How? Deep learning Start of Quality Quality Quality End of production Check x, Check x, Check x, production ' 1 Product data Test processes (Vehicle (Testing protocol) configuration) Error Test = Test = No error pattern positive negative pattern BMW manufacturing engineers ensure high production quality using insights from Splunk, which provides a holistic view of vehicle data during production. Using DSDL, the BMW Innovation Lab team identified benchmarks for different vehicle types and configurations using Uniform Manifold Approximation and Projection (UMAP), helping BMW generate baselines for expected behaviors and error",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_29",
    "text": "patterns. Using the dataset of expected baselines and error patterns, BMW trained a dense neural network to predict potential issues with test results, flagging vehicles that might require additional checks. Using these analytics, engineers on the factory floor can troubleshoot vehicles during production. Read about BMW’s experience with the Splunk App for Data Science and Deep Learning here. In addition, listen to the BMW team and Splunk discuss their use of ML here. Volkswagen Volkswagen was keen to gain better visibility into their manufacturing processes to improve their security posture. The data required for gaining better visibility also led to work on use cases that would reduce unplanned maintenance. With hundreds of meters of production lines within a single plant and dozens of production cells performing different tasks, Volkswagen implemented a passive collection architecture to provide visibility into their production processes. From this architecture, Volkswagen can obtain an overview of metrics and status messages for each production cell, such as Programmable Logic Controller (PLC) changes, protocol and data volumes, and logical communications. The data allowed Volkswagen to generate baseline behaviors for normal production cycles, as well as the ability to flag deviations from historic baselines. Read more about Volkswagen’s use",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_30",
    "text": "of ML here. Splunk Artificial Intelligence for Observability | Splunk 20 Honda Honda has hundreds of manufacturing plants worldwide, and their plant in Alabama runs on a just-in-time delivery model. Therefore, any downtime at this plant can impact the downstream supply chain and ultimately customers. Acritical component of the factory is the regenerative thermal oxidiser used to remove environmentally damaging volatile organic compounds during the production process. If the oxidiser goes down, the plant has to halt production. Using Splunk’s MLTK, Honda was able to create a predictive model for potential failures with the oxidiser, with engineers having taken preventative action based on anomalies observed with the motor. Some of their detailed use cases included predicting chamber temperatures 24 hours in advance using the StateSpaceF orecast algorithm, using DensityFunction to identify outliers in motor readings, and creating a glass table to present all of the predictive indicators to equipment engineers. Read about Honda's experience here. Further information Stimson Lumber Co. used Splunk and MLTK to autonomously detect outliers and assess their impact on production processes, enabling maintenance teams to react faster and more accurately to potential problems. Read about Stimson Lumber Co.'s experience with MLTK here. The Battelle Memorial Institute",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_31",
    "text": "is one of the partners who work at the Pueblo Chemical Destruction Agent Pilot Plant, a facility designed to destroy chemical weapons. The Battelle Memorial Institute used ML to identify the impacts that readings were having on other metrics, helping to inform maintenance of certain systems. Read more about the work at the Pueblo Chemical Destruction Agent Pilot Plant here. ESE GmbH is a services provider operating out of Germany specializing in rail operations, automotive production, and the manufacturing industry. While working for a customer, ESE GmbH was engaged to help with the operations of a sugar processing plant and used MLTK to uncover insights that supported increasing sugar output, increasing the runs per day, and avoiding machine failures. Find out more about ESE GmbH's work with MLTK here. Splunk Artificial Intelligence for Observability | Splunk 21 7. Cell tower monitoring Business challenge Communication service providers (CSPs) provide a world class experience to customers by avoiding issues like traffic congestion. Therefore, being able to identify and prevent potential issues with network infrastructure is a critical part of providing a great customer experience. With most CSPs running a huge number of connected devices and network components across a broad geographic area,",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_32",
    "text": "understanding and baselining normal traffic patterns can be a challenge to effective monitoring. Splunk’s approach With Splunk’s MLTK, users can train and apply ML models that can detect anomalies in network traffic data, forecast or predict traffic patterns, or cluster entities into cohorts. These ML techniques can be applied via guided workflows or directly as a search. Value Improve detection efficiency: ML offers numerous end user benefits for monitoring cell tower data, such as reduction in cell tower congestion, improvements in data speeds for subscribers, reduction in customer complaints, and ultimately a better user experience. Reduce manual processing: Furthermore, by automating the detection of network issues, engineering teams can gain efficiency, and network resources can be utilized more efficiently. Case studies and further information T-Mobile T-Mobile has been partnering with Splunk for many years to apply ML to their cell tower network data. By using ML across a range of different network use cases, T-Mobile predicts potential outages, optimizes 5G networks for better throughput, and uses anomaly detection to help remediate potential messaging issues. T-Mobile began by analyzing cell tower congestion in 2019. Using the StateSpaceForecast algorithm to forecast congestion, T-Mobile was able to predict points in time when there",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_33",
    "text": "would be congestion. In addition, T-Mobile implemented a dashboard for operators to mark predicted congestion as actual or not, helping continuously improve their detections. Read more about this use case from T-Mobile here. Operating America’s largest 5G network, T-Mobile's radio frequency engineers often have to balance capacity and coverage to ensure the best user experience for their customers. With thousands of cell towers and hundreds of configurable network parameters, this can be a challenging task, often requiring multiple manual iterations by engineers in order to achieve the best results. Using configuration and capacity data in Splunk, the team at T-Mobile developed an anomaly detection model using the DensityFunction algorithm to identify cell towers that require additional configuration, reducing the time required by engineers to manually tune the network. In one particular location in New York, tuning based on the anomaly detection model improved data speeds by over 80%. Read more about this use case here. Messaging services are extremely complicated, often traversing multiple nodes on the network, which are underpinned by many more services. With thousands of metrics generated by messaging services, understanding what a healthy system looks like can be difficult. Through use of an anomaly detection system, T-Mobile",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_34",
    "text": "was able to reduce P1 and P2 incidents, reduce customer reported issues, and reduce the mean time to detect potential network issues. Read about this use case from T-Mobile here. Splunk Artificial Intelligence for Observability | Splunk 22 8. Geohazards monitoring Spotlight case study Norwegian Water Resources and Energy Directorate (NVE) The final use case is observability for the physical world-how NVE uses Splunk to support their early warning system for potential rockslides. Rockslides in Norway can have devastating consequences, with whole villages washed away by tsunamis caused by sudden rockslides. Having an early warning system in place to warn citizens of potential rockslides is particularly important in remote parts of northern Norway, where evacuations often can take more planning than in more populated regions. Taking data from dozens of different types of sensor devices, NVE uses Splunk to provide visibility into environmental situations, with many sensors used to provide information about rock degradation. With sensors placed in hazardous locations, often exposed to extreme weather conditions, getting accurate readings from the sensors can be difficult. Using Splunk’s MLTK, NVE in partnership with Sopra Steria are able to remove outliers from their sensor readings, helping to provide accurate views on the",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_35",
    "text": "risk of potential rockslides. By using ML to improve the data quality, NVE can improve decision making. Hear about NVE’s use of ML here. Splunk Artificial Intelligence for Observability | Splunk 23 Get started today Download MLTK and DSDL to get started with Al/ML! (But first you need Splunk Cloud Platform or Splunk Enterprise! If you don’t have one of these yet, you can try a free trial.) Check out our MLTK Deep Dives for detailed implementation guides for some popular uses of Alin Splunk, including a video overview and detailed walkthrough. Explore solutions like IT Service Intelligence or Splunk Infrastructure Monitoring for out-of-the-box Al use cases. Review Splunk Blogs to find out more about given techniques and approaches to Al in Splunk (check out some of these in the table below). For current users, your Splunk account team will also be able to help you explore support that is available from Splunk for implementing ML use cases. Blogs Anomaly Detection Predictive Analytics Clustering Cyclical Statistical Forecasts and Anomalies part 1 Cyclical Statistical Forecasts and Anomalies part 2 Anomalies Are Like a Gallon of Neapolitan Ice Cream part 2 Cyclical Statistical Forecasts and Anomalies part 4 Cyclical Statistical Forecasts and",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "Splunk_AI_Research.pdf_36",
    "text": "Anomalies part 3 Cyclical Statistical Forecasts and Anomalies part 5 Anomalies Are Like a Gallon of Neapolitan Ice Cream part 1 Cyclical Statistical Forecasts and Anomalies part 6 Anomalies Are Like a Gallon of Neapolitan Ice Cream part 2 A Splunk Approach to Baselines, Statistics and Likelihoods | ITS! and Sophisticated Machine Learning on Big Data Anomalies Are Like a Gallon of Neapolitan Ice Cream part 1 Predicting Resource Exhaustion with Double Exponential Smoothing Anomalies Are Like a Gallon of Neapolitan Ice Cream part 2 Splunk, Splunk> and Turn Data into Doing are tra other countries, llother brandnames, product Allrights reserved, splunk>",
    "source": "Splunk_AI_Research.pdf"
  },
  {
    "id": "mfa.pdf_0",
    "text": "11/8/25, 11:21 AM Why Multi-Factor Authentication (MFA) Is Important | Okta Solve authorization for agents and phishing. Register now > 3\"@ okta Why Multi-Factor Authentication (MFA) Is Important UPDATED: SEPTEMBER O2, 2024 TIME TO READ: ~ 6 MINUTES TABLE OF CONTENTS v Multi-factor authentication (MFA) is an IT authentication technique that requires a user to present at least two factors that prove their identity. Why Use MFA? Cybercriminals have more than 15 billion stolen credentials to choose from. If they choose yours, they could take over your bank accounts, health care records, company secrets, and more. Multi-factor authentication is important, as it makes stealing your information harder for the average criminal. The less enticing your data, the more likely that thieves will choose someone else to target. https:/www.okta.com/identity-101/why-mfa-is-everywhere/ 118 11/8/25, 11:21 AM Why Multi-Factor Authentication (MFA) Is Important | Okta As the name implies, MFA blends at least two separate factors. One is typically your username and password, which is something you know. The other could be: Something you have. A cellphone, keycard, or USB could all verify your identity. Something you are. Fingerprints, iris scans, or some other biometric data prove that you are who you say you are.",
    "source": "mfa.pdf"
  },
  {
    "id": "mfa.pdf_1",
    "text": "Adding this secondary factor to your username/password protects your privacy. And it’s remarkably easy for most people to set up. Do Passwords Offer Enough Security? We all use passwords to gain entry into our email systems, work databases, and bank accounts. We are usually forced to change our combinations periodically in the hopes that we'll stay just a bit safer. But the truth is that, on their own, passwords no longer provide an appropriate level of security. Consider Google. One password gives access to: Email. The messages you've sent, those you've received, and the accounts you talk to are all stored in the system and protected with only a password. Calendars. Information about who you've met, where you were, and what you did are all linked to a password. YouTube. Your password unlocks your viewing history, your uploads, and records about videos you enjoyed. Other web apps. Use your Google account to connect to other online resources, such as Hootsuite or Salesforce, and your password could reveal a great deal of data. In 2017, Google admitted that hackers steal almost 250,000 web logins each week. That number could be even higher now. And each incident can be incredibly dangerous. https:/www.okta.com/identity-101/why-mfa-is-everywhere/",
    "source": "mfa.pdf"
  },
  {
    "id": "mfa.pdf_2",
    "text": "218 11/8/25, 11:21 AM Why Multi-Factor Authentication (MFA) Is Important | Okta When we think about data breaches, we often think about bank accounts and lost money. But the health care sector is also a common target for hackers. Once inside, people can change your medical records to bill fraudulent companies and make money. An altered record is incredibly difficult to change, and it could impact your health care and credit going forward. Companies are recognizing these risks and acting accordingly. More than 55 percent of enterprises use MFA to protect security, and that number rises each year. If you haven't considered this technique, it's time to start. How Does MFA Work? Most MFA systems won't eliminate usernames and passwords. Instead, they layer on another verification method to ensure that the proper people come in and the thieves stay out. A typical MFA process looks like this: ¢ Registration: A person links an item, such as a cellphone or a key fob, to the system and asserts that this item is theirs. ¢ Login: A person enters a username and password into a secure system. Verification: The system connects with the registered item. Phones might ping with verification codes, or",
    "source": "mfa.pdf"
  },
  {
    "id": "mfa.pdf_3",
    "text": "key fobs might light up. Reaction: The person completes the process with the verified item. Entering verification codes or pushing a button on a key fob are common next steps. Some systems demand this verification with each login, but some systems remember devices. If you always use the same phone or computer to log in, you may not need to verify each visit. But if you attempt to log in on anew computer or during an unusual time of day, verification might be required. MFA may seem simple, but it's remarkably effective. Microsoft says, for example, that MFA blocks nearly 100 percent of account hacks. This one tiny step could protect your security in a huge way. https:/www.okta.com/identity-101/why-mfa-is-everywhere/ 3/8 11/8/25, 11:21 AM Why Multi-Factor Authentication (MFA) Is Important | Okta Benefits of Multi-Factor Authentication Countless organizations have adopted MFA, given the realities of today’s security landscape and regulations. With compliance standards like GDPR and NIST requiring sophisticated security policies, MFA’s presence will only continue to become more widespread. But given its ease of use and the protection it provides, this only stands to benefit employees and IT teams alike. What’s behind the pervasiveness of MFA? There are several reasons for",
    "source": "mfa.pdf"
  },
  {
    "id": "mfa.pdf_4",
    "text": "MFA’s ubiquity in today’s corporate world. MFA Enables Stronger Authentication Risk reduction is critical for organizations, which is why multi-factor authentication is growing exponentially. In a world where credential harvesting is a constant threat and over 80 percent of hacking-related breaches are caused by stolen or weak passwords, this kind of bulletproof authentication solution is essential. With MFA, it’s about granting access based on multiple weighted factors, thereby reducing the risks of compromised passwords. It adds another layer of protection from the kinds of damaging attacks that cost organizations millions. A security breach caused by a weak user password would understandably have huge consequences for both the company and the customers who trust it. MFA Adapts to the Changing Workplace As the workplace changes and more employees work outside the office, companies require more advanced MFA solutions to manage more complex access requests. Enter Adaptive MFA. Where multi-factor authentication offers multiple layers of protection, adaptive multi-factor authentication evaluates the risk a user presents whenever they request access to a tool or information, looking at details like the user’s device and location for context. https:/www.okta.com/identity-101/why-mfa-is-everywhere/ 418 11/8/25, 11:21 AM Why Multi-Factor Authentication (MFA) Is Important | Okta For example, an employee",
    "source": "mfa.pdf"
  },
  {
    "id": "mfa.pdf_5",
    "text": "logging in from the company premises is ina trusted location and may not be prompted for an additional security factor. But if that same employee logs in from a coffee shop, uses their personal mobile phone to check work emails, or connects over an unsecured WiFi network, they may be prompted to verify an additional factor because they are utilizing an untrusted location, device, or connection. Adaptive MFA also allows for dynamic policy changes and step-up authentication — significant controls in securing critical data. For instance, users may be prompted for a higher assurance second factor (or even a third factor) before obtaining access to deeply sensitive information, such as customer data in Salesforce. MFA Offers Security Without Compromising User Experience Passwords are a headache to remember — the more users need to remember, the lazier their password habits become. Moreover, it’s important to avoid weighing IT teams down with password resets after they’ve implemented more stringent password policies to protect the company. MFA secures the environment, the people in it, and the devices they’re using without requiring cumbersome resets or complicated policies. Organizations can also make it easier for users by providing them with a variety of factors to",
    "source": "mfa.pdf"
  },
  {
    "id": "mfa.pdf_6",
    "text": "choose from or by only requiring additional factors when necessary. With MFA’s simple deployment and management as well as its integration with a broad range of applications, IT teams are freed up and can focus this time on more strategic tasks. Try Okta Free Security comes standard for all Okta Single Sign-On customers, which now includes Okta Verify One-Time Password protection. Learn how adaptive MFA could be right for your organization today. Try Okta free for 30 days. References https:/www.okta.com/identity-101/why-mfa-is-everywhere/ 5/8 11/8/25, 11:21 AM Why Multi-Factor Authentication (MFA) Is Important | Okta New Dark Web Audit Reveals 15 Billion Stolen Logins From 100,000 Breaches. (uly 2020). Forbes. Google Says Hackers Steal Almost 250,000 Web Logins Each Week. (November 2017). CNN. You've Been Breached: Hackers Stole Nearly Half a Billion Personal Records in 2018. (February 2019). NBC. More Enterprises Use Multi-Factor Authentication to Secure Passwords. (October 2019). Security. Back to Basics: Multi-Factor Authentication (MFA). (December 2019). National Institute of Standards and Technology. Microsoft: Using Multi-Factor Authentication Blocks 99% of Account Hacks. (August 2019). ZD Net. SHARE ? Hx Recommended articles £30 0 oO OCT 30, 2025 What is identity security fabric? £3 0. oO https:/www.okta.com/identity-101/why-mfa-is-everywhere/ 6/8 11/8/25, 11:21 AM Why Multi-Factor",
    "source": "mfa.pdf"
  },
  {
    "id": "mfa.pdf_7",
    "text": "Authentication (MFA) Is Important | Okta OCT 29, 2025 What is Al agent identity? Securing autonomous systems [| 0. oO OCT 16, 2025 What Is Access Control & How Crucial Is It to Cybersecurity? Continue your Identity journey Get hands on with the free trial today, or get in touch with our team to discuss your unique needs. Get started Starting with Okta Okta Platform AuthO Platform Pricing Free Trial Contact Sales https:/www.okta.com/identity-101/why-mfa-is-everywhere/ 7/8 1118/25, 11:21 AM Why Multi-Factor Authentication (MFA) Is Important | Okta Help & Support Help & Support Contact Us Okta Platform Status AuthO Platform Status To connect with a product expert today, email us or call +|-800-425-1267. Contact us Legal Privacy Policy Site Terms Security Sitemap Cookie Preferences Your Privacy Choices Copyright © 2025 Okta. All rights reserved. https:/www.okta.com/identity-101/why-mfa-is-everywhere/ 8/8",
    "source": "mfa.pdf"
  },
  {
    "id": "scattered_spider.pdf_0",
    "text": "*#< WIKIPEDIA ‘nm WY the Free Encyclopedia Scattered Spider Scattered Spider, also referred to as UNC3944 and, more recently identified as ShinyHunters,\"J is a hacking group mostly made up of teens and young adults believed to live in the United States and the United Kingdom. 2131] The group is believed to be | Nickname See § Names affiliated with cybercriminal network, \"The Com\", or more specifically the Hacker Com, a _ Formation ¢, May 2022 subset of The Com. l4lls] Scattered Spider, ShinyHunters Type Hacker group The group gained notoriety for their involvement in the hacking and extortion of Caesars | Purpose = Ransomware, cyberattacks, data Entertainment and MGM Resorts International, two of the largest casino and gambling theft extortion companies in the United States. Scattered Spider has also targeted Visa, Marks & Spencer, | Region United States and United PNC Financial Services, Transamerica, New York Life Insurance, Synchrony Financial, Kingdom 5 a: [6 Truist Bank, Twilio,!© and JLR.!7] Methods __ Social engineering, ransomware : . : as a service, password crackin! Members of Scattered Spider have been connected with the hacks against Snowflake cloud PB S storage customers in the US.!8Il910] More recently, members of Scattered Spider have been",
    "source": "scattered_spider.pdf"
  },
  {
    "id": "scattered_spider.pdf_1",
    "text": "connected with the hacks against Qantas, the flag carrier of Australia.4J22J03] Affiliations ALPHV, ShinyHunters The Scattered Spider group is now believed to be part of, or identical to, the ShinyHunters cybercriminal group, 4115] Names The group's most common name as used in press releases and by journalists is Scattered Spider, though many other names have been attributed to the group. Star Fraud, Octo Tempest, Scatter Swine, and Muddled Libra have all been names used to refer to the group previously./16] Scattered Spider is a component of a larger global hacking community, known as \"the Community\" or \"The Com\", itself having members who have hacked major American technology companies.!\"61 History Scattered Spider is believed to have been founded in May 2022, when the group was focused on attacks on telecommunications firms. The group utilized SIM swap scams, multi-factor authentication fatigue attacks, and phishing by SMS and Telegram. The group typically exploited the security bug CVE-2015-2291 (https://nvd.nist.gov/vuln/detail/cve-2015-2291), a cybersecurity issue in Windows’ anti-DoS software,'7] to terminate security software, allowing the group to evade detection. The group is believed to have a deep understanding of Microsoft Azure, the ability to conduct reconnaissance in cloud computing platforms powered by Google Workspace and AWS, and",
    "source": "scattered_spider.pdf"
  },
  {
    "id": "scattered_spider.pdf_2",
    "text": "utilizes legitimately-developed remote-access tools. The group later became known for targeting critical infrastructure prior to moving on to its 2023 casino hacks.8] In 2025, DataBreaches.net!% reported that Scattered Spider have merged with ShinyHunters or vice versa.(201[24] Casino hacks (2023) Scattered Spider gained access to both Caesars' and MGM's internal systems through the use of social engineering. The group was able to bypass multi-factor authentication technologies by attaining login credentials and one-time passwords.!221[23] The group claims that it targeted MGM due to them catching the group attempting to rig slot machines in their favor.!241 Caesars Caesars Entertainment paid a ransom of $15 million to Scattered Spider, half their original demand of $30 million. Scattered Spider, using similar tactics to its attack on MGM, was able to access driver's license numbers and possibly Social Security numbers, for a “significant number\" of Caesars' customers. Statements made by Caesars noted that while the company cannot guarantee the deletion of the information attained by Scattered Spider, the casino operator will take all necessary actions to attain such result.[2] Sources dispute on whether Scattered Spider was the group which targeted Caesars, with some believing it was the British-American group while others say the perpetrators were not",
    "source": "scattered_spider.pdf"
  },
  {
    "id": "scattered_spider.pdf_3",
    "text": "the group or unknown. !251[261[241 MGM Resorts Scattered Spider collaborated with ALPHV, a software development team which provides ransomware as a service. Scattered Spider called MGM's help desk posing as an employee it found on LinkedIn to gain internal access. The group gained access on September 11, [22] 2023. MGM Resorts first disclosed the cyberattack on September 12, 2023, in a Form 8-K report with the SEC the next day.[27I[28] The company stated that though it has \"dealt\" with the cyberattack, many of the computer systems at its resorts remain offline, which include but are not limited to credits for food, beverages, and free credits. The attack further disabled on-site ATMs as well as remote room keys, and prevented MGM from charging patrons for parking.!231 In July 2024, a 17-year old hacker from the United Kingdom was arrested in connection with the hack and attempted ransom. He has been released on bail pending trial.!29] The arrest was coordinated by local and international law enforcement. Aftermath MGM and the US FTC and FBI are at present investigating the cyberattack, and the casino operator temporarily took down its website, [31 Moody's Corporation has stated that due to MGM's heavy reliance on computers",
    "source": "scattered_spider.pdf"
  },
  {
    "id": "scattered_spider.pdf_4",
    "text": "for much of its operations, its credit rating could go down as a result of the cyberattack.81 Upon the announcement of both companies' attacks, the stock prices for both Caesars and MGM dropped. MGM's CEO William Hornbuckle went on to note at an industry conference that the hack caused the company to be \"completely in the dark\" about its properties.! Both MGM and Caesars were sued in class action lawsuits by customers following the hacks, with all stating that the failure for both of the casino operators to adequately secure their data constituted breach of contract. The law firms’ clients also all demanded jury trials.!301l31] ty January 2025, MGM agreed to pay a $45 million settlement to the victims of the breach. !321[331 Snowflake hacks Two members of the group have been connected with hacks against customers of Snowflake's cloud computing. The hackers accessed and stole customer data, demanding millions of dollars. Nearly a hundred victims were targeted, including AT&T, Ticketmaster, Advance Auto Parts, LendingTree and Neiman Marcus. '81341 Arrests In January 2024, Noah Michael Urban, a member of the group!35] and known as \"Sosa\", \"King Bob\", \"Elijah\", and other aliases, was arrested in Florida for the cumulative theft of",
    "source": "scattered_spider.pdf"
  },
  {
    "id": "scattered_spider.pdf_5",
    "text": "about $800,000 in cryptocurrency.!3 Sosa used SIM-swapping techniques in order to compromise victims' email and financial account details. In June 2024, the alleged leader of the group, Tyler Buchanan (aka TylerB), was arrested in Spain when attempting to board a flight to Italy. {871[381 At the time of his arrest, Spanish police allege that Buchanan possessed Bitcoins worth $27 million. In July 2024, the West Midlands Police with the help of the FBI arrested a 17-year old juvenile in connection with the MGM cyberattacks. The suspect, who lives in Walsall and whose name was not published, was released on bail while law enforcement examined his devices.{39] 19-year-old Remington Ogletree was arrested in November 2024 on charges related to his alleged involvement with the group. [4°] On September 17, 2025, a juvenile suspect local to the casino-hacking case surrendered to Clark County Juvenile Detention Center, '41] See also = LockBit References 1 . \"Scattered Spider: The Modus Operandi\" (https://www.trellix.co m/en-us/about/newsroom/stories/research/scattered-spider-the -modus-operandi.html). www. trellix.com. Retrieved September 14, 2023. . \"Caesars Entertainment says it was also a victim of a cyberattack\" (https://www.nbcnews.com/tech/security/caesars- entertainment-says-was-also-victim-cyberattack-rcna105050). NBC News. September 14, 2023. Retrieved September 14, 2023. . Bracken, Becky (September 14, 2023). \"'Scattered Spider' Behind MGM Cyberattack,",
    "source": "scattered_spider.pdf"
  },
  {
    "id": "scattered_spider.pdf_6",
    "text": "Targets Casinos\" (https://www.darkr eading.com/attacks-breaches/-scattered-spider-mgm-cyberatta ck-casinos). Dark Reading. Retrieved September 14, 2023. . \"Internet Crime Complaint Center (IC3) | Hacker Com: Cyber Criminal Subset of The Community (Com) is a Rising Threat to Youth Online\" (https://www.ic3.gov/PSA/2025/PSA250723). www.ic3.gov. Retrieved September 23, 2025. 5. Jones, David (July 30, 2025). \"What we know about the cybercrime group Scattered Spider\" (https:/Awww.cybersecurity dive.com/news/what-we-know-about-the-cybercrime-group-sca ttered-spider/756312/). Cybersecurity Dive. 6. \"ShinyHunters Leak What They Claim Are 33M Twilio Authy Phone Numbers, Neiman Marcus and Truist Bank Data\" (http s://databreaches.net/2024/07/05/shinyhunters-leak-what-they- claim-are-33m-twilio-authy-phone-numbers-neiman-marcus-an d-truist-bank-data/). DataBreaches.Net. July 5, 2024. Retrieved September 8, 2025. 7. Almeida, Lauren (September 16, 2025). \"Jaguar Land Rover extends production shutdown after cyber-attack\" (https://Awww.t heguardian.com/business/2025/sep/16/jaguar-land-rover-prod uction-shutdown-cyber-attack). The Guardian. ISSN 0261- 3077 (https://search.worldcat.org/issn/0261-3077). Retrieved September 19, 2025. 10. 11. 12. 13. 14. 15. . \"Snowflake Hacker Still Active, Finding New Victims, Expert Says\" (https:/Awww.bloomberg.com/news/articles/2024-09-20/s nowflake-hacker-still-active-finding-new-victims-expert-says). Bloomberg.com. September 20, 2024. Retrieved January 15, 2025. . Mapp, Karis (November 28, 2024). \"Kitchener, Ont., man arrested in massive Snowflake hacking scheme faces possible extradition to U.S.\" (https:/Awww.cbc.ca/news/canada/kitchener -waterloo/snowflake-data-breach-kitchener-accused-possible-e xtradition-1.7394891) CBC News. CBC. Retrieved May 24, 2025. Tidy, Joe (May 21, 2025). \"Retail hackers believed to be young and from US and UK, detectives say\" (https://www.bbc.com/ne ws/articles/ckgnndrgxv30). BBC News. BBC World Service. Retrieved May",
    "source": "scattered_spider.pdf"
  },
  {
    "id": "scattered_spider.pdf_7",
    "text": "24, 2025. \"What we know about Scattered Spider, the hacker group targeting airlines\" (https:/Awww.abc.net.au/news/2025-07-02/wh o-are-scattered-spider-hackers-qantas-data-breach/10548567 4). ABC News. July 2, 2025. Retrieved July 12, 2025. Abrams, Lawrence. \"Qantas discloses cyberattack amid Scattered Spider aviation breaches\" (https://www.bleepingcom puter.com/news/security/qantas-discloses-cyberattack-amid-sc attered-spider-aviation-breaches/). BleepingComputer. Retrieved September 8, 2025. Abrams, Lawrence. \"ShinyHunters behind Salesforce data theft attacks at Qantas, Allianz Life, and LVMH\" (https://www.bl eepingcomputer.com/news/security/shinyhunters-behind-salesf orce-data-theft-attacks-at-qantas-allianz-life-and-lvmh/). BleepingComputer. Retrieved September 8, 2025. \"Are Scattered Spider and ShinyHunters one group or two? And who did France arrest? (1)\" (https://databreaches.net/202 5/08/03/are-scattered-spider-and-shinyhunters-one-group-or-t wo-and-who-did-france-arrest/). DataBreaches.Net. August 3, 2025. Retrieved September 8, 2025. Abrams, Lawrence. \"ShinyHunters behind Salesforce data theft attacks at Qantas, Allianz Life, and LVMH\" (https://www.bl eepingcomputer.com/news/security/shinyhunters-behind-salesf orce-data-theft-attacks-at-qantas-allianz-life-and-lvmh/). BleepingComputer. Retrieved September 8, 2025. 16. 17. 18. 19. 20. 21. 22. 23. Whitaker, Bill; Chasan, Aliza; Messick, Graham; Weingart, Jack (April 14, 2024). \"Criminal exploits of Scattered Spider earn respect of Russian ransomware hackers - CBS News\" (htt ps://www.cbsnews.com/news/scattered-spider-blackcat-hacker s-ransomware-team-up-60-minutes/). www.cbsnews.com. Retrieved April 23, 2024. \"CVE-2015-2291 : (1) IQVW32.sys before 1.3.1.0 and (2) IQVW64.sys before 1.3.1.0 in the Intel Ethernet diagnostics driver for Windows all\" (https://www.cvedetails.com/cve/CVE-2 015-2291/). www.cvedetails.com. Retrieved September 14, 2023. \"MGM Resorts breached by 'Scattered Spider’ hackers: Sources\" (https://www.businessinsurance.com/article/2023091 4/INEWS06/912359825/MGM-Resorts-breached-by-%E2%8 0%98Scattered-Spider%E2%80%99-hackers-Sources). Business Insurance. Retrieved September 14, 2023. \"Are Scattered",
    "source": "scattered_spider.pdf"
  },
  {
    "id": "scattered_spider.pdf_8",
    "text": "Spider and ShinyHunters one group or two? And who did France arrest? (1)\" (https://databreaches.net/202 5/08/03/are-scattered-spider-and-shinyhunters-one-group-or-t wo-and-who-did-france-arrest/). DataBreaches.Net. August 3, 2025. Retrieved September 8, 2025. Kovacs, Eduard (August 6, 2025). \"Google Discloses Data Breach via Salesforce Hack\" (https://www.securityweek.com/g oogle-discloses-salesforce-hack/). SecurityWeek. Retrieved August 30, 2025. \"Are Scattered Spider and ShinyHunters one group or two? And who did France arrest? (1)\" (https://databreaches.net/202 5/08/03/are-scattered-spider-and-shinyhunters-one-group-or-t wo-and-who-did-france-arrest/). DataBreaches. Net. August 3, 2025. Retrieved September 8, 2025. Siddiqui, Zeba; Bing, Christopher; Bing, Christopher (September 13, 2023). \"MGM Resorts breached by ‘Scattered Spider’ hackers: sources\" (https://www.reuters.com/technolog y/moodys-says-breach-mgm-is-credit-negative-disruption-linge ts-2023-09-13/). Reuters. Retrieved September 14, 2023. \"Young hackers are sticking up Las Vegas casinos for hefty ransoms\" (https://qz.com/young-hackers-are-sticking-up-las-ve gas-casinos-for-hef-1850837238). Quartz. September 14, 2023. Retrieved September 14, 2023. 24. 25. 26. 27. 28. 29. 30. 31. Srivastava, Mehul (September 14, 2023). \"MGM hack followed failed bid to rig slot machines, ‘Scattered Spider’ group claims\" (https://www.ft.com/content/a25d2897-b0ce-4ba7-92ed-ff5df09 d1b47). Financial Times. Retrieved September 15, 2023. Murphy, Aislinn (September 13, 2023). \"Caesars Entertainment reportedly paid ransomware demand\" (https://www.foxbusines s.com/markets/caesars-entertainment-reportedly-paid-ransom ware-demand). FOXBusiness. Retrieved September 15, 2023. Gendron, Will. \"MGM Resorts is still suffering from a massive outage after a notorious group of young hackers apparently tricked workers into handing over access to the company's network\" (https://www.businessinsider.com/mgm-caesars-las-v egas-casinos-targeted-scattered-spider-hacking-group-2023-",
    "source": "scattered_spider.pdf"
  },
  {
    "id": "scattered_spider.pdf_9",
    "text": "9). Business Insider. Retrieved September 15, 2023. \"Investors - Financial Info - SEC Filings - SEC Filings Details\" (https://investors.mgmresorts.com/investors/financial-info/sec-fi lings/sec-filings-details/default.aspx?Filingld=16927190). investors.mgmresorts.com. \"FORM 8-K - MGM Resorts International\" (https://web.archive. org/web/202309150001 05/https://d18rn0p25nwr6d.cloudfront.n et/CIK-0000789570/a390c443-0c40-4025-aba2-74505ab3c9e 3.pdf) (PDF). Archived from the original (https://d18rn0p25nwr6 d.cloudfront.net/CIK-0000789570/a390c443-0c40-4025-aba2-7 4505ab3c9e3.pdf) (PDF) on September 15, 2023. Encinas, Amaris. \"U.K. police arrest 17-year-old in connection with last year's MGM cyberattack\" (https:/Awww.usatoday.com/s tory/tech/news/2024/07/19/uk-police-arrest-teen-for-mgm-cybe rattack/74477012007/). USA TODAY. Retrieved July 22, 2024. \"Complaints filed say MGM Resorts, Caesars Entertainment failed to protect information from cyberattack\" (https://www.ktn v.com/news/complaints-filed-say-mgm-resorts-caesars-entertai nment-failed-to-protect-information-from-cyberattack). Channel 13 Las Vegas News KTNV. September 26, 2023. Retrieved September 26, 2023. Croft, Daniel (September 26, 2023). \"5 class actions launched against MGM, Caesars\" (https:/Awww.cybersecurityconnect.co m.au/commercial/9607-5-class-actions-launched-against-mgm -caesars). www.cybersecurityconnect.com.au. Retrieved September 26, 2023. 32. 33. 34. 35. 36. 37. 38. 39. Weatherbed, Jess (January 29, 2025). \"MGM will pay $45 million to settle data breach lawsuit\" (https://www.theverge.co m/news/601733/mgm-resorts-45-million-settlement-data-breac hes). The Verge. Retrieved March 14, 2025. \"Owens v. MGM Resorts International\" (https://storage.courtlist ener.com/recap/gov.uscourts.nvd.164564/gov.uscourts.nvd.16 4564.63.0.pdf) (PDF). CourtListener. Retrieved March 14, 2025. Burgess, Matt. \"The Snowflake Attack May Be Turning Into One of the Largest Data Breaches Ever\" (https://www.wired.co m/story/snowflake-breach-advanced-auto-parts-lendingtree/). Wired. ISSN 1059-1028 (https://search.worldcat.org/issn/1059- 1028). Retrieved January 15, 2025. \"Fla. Man Charged in SIM-Swapping Spree is Key Suspect in Hacker",
    "source": "scattered_spider.pdf"
  },
  {
    "id": "scattered_spider.pdf_10",
    "text": "Groups Oktapus, Scattered Spider — Krebs on Security\" (https://krebsonsecurity.com/2024/01/fla-man-charge d-in-sim-swapping-spree-is-key-suspect-in-hacker-groups-okta pus-scattered-spider/). January 30, 2024. Retrieved July 22, 2024. Fernandez, Frank. \"Palm Coast teen accused in cryptocurrency scheme seeks jail release as he awaits trial\" (ht tps://www.news-journalonline.com/story/news/courts/2024/04/0 3/palm-coast-teen-in-cryptocurrency-scam-seeks-release-from -jail/73148333007/). Daytona Beach News-Journal Online. Retrieved July 22, 2024. \"Alleged Boss of 'Scattered Spider’ Hacking Group Arrested — Krebs on Security\" (https://krebsonsecurity.com/2024/06/allege d-boss-of-scattered-spider-hacking-group-arrested/). June 16, 2024. Retrieved July 22, 2024. \"U.K. Hacker Linked to Notorious Scattered Spider Group Arrested in Spain\" (https://thehackernews.com/2024/06/uk-hac ker-linked-to-notorious-scattered.html). The Hacker News. Retrieved July 22, 2024. Roth, Emma (July 19, 2024). \"UK teen arrested in connection to MGM hack\" (https://www.theverge.com/2024/7/19/2420214 2/uk-teen-mgm-hack-arrested-fbi). The Verge. Retrieved July 22, 2024. 40. \"California Teen Suspected of Being a Member of Scattered Spider Hacking Gang\" (https://www.bloomberg.com/news/articl es/2024-12-03/scattered-spider-hacking-gang-arrests-mount-w ith-california-teen). Bloomberg.com. December 3, 2024. Retrieved December 4, 2024. External links 41. \"Teenage hacker arrested for cyberattacks against Las Vegas casinos\" (https://www.usatoday.com/story/news/crime/2025/09/ 22/teen-arrested-vegas-2023-casino-cyberattack/8629966400 7/1). USA TODAY. Retrieved September 24, 2025. = Scattered Spider Cybersecurity Advisory (https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-320a); Cybersecurity and Infrastructure Security Agency website. Retrieved from \"https://en.wikipedia.org/w/index.php?title=Scattered_Spider&oldid=1318083515\"",
    "source": "scattered_spider.pdf"
  },
  {
    "id": "writeup_1.pdf_0",
    "text": "11/8/25, 11:20 AM Stored XSS with Cloudflare WAF Bypass | by Aland Dishad (HexaPhp) | Medium Openinapp 7 Gign up) Sign in Medium Q Search FZ Write Stored XSS with Cloudflare WAF Bypass e@ Aland Dishad (HexaPhp) 2minread - Sep 6, 2025 a + S57 Q2 wn ® 8 While testing a site protected by Cloudflare, I came across some input fields that appeared to be storing user data. Naturally, I wanted to check if the stored data was being rendered unsanitized in the frontend. So, I started simple — a basic HTML injection to confirm output was being reflected. I submitted: <u>Aland Dlshad</u> https://hexaphp.medium.com/stored-xss-with-cloudflare-waf-bypass-420c99aba97b 11/8/25, 11:20 AM Stored XSS with Cloudflare WAF Bypass | by Aland Dishad (HexaPhp) | Medium O Copy (~ @rminevatmon | { Osnarwonrocenece | [ X-snoreonx crite) | © Add Move = --—- & nvitations History Recipient Referral Date Status > Aland Dishad \"»Aland Olshad ais i LO) And sure enough, it rendered just like that. This told me the input wasn't being properly encoded or sanitized before being displayed — definitely a red flag. Next, I tried a classic stored XSS payload: Get Aland Dlshad (HexaPhp)’s stories in your inbox Join Medium for free",
    "source": "writeup_1.pdf"
  },
  {
    "id": "writeup_1.pdf_1",
    "text": "to get updates from this writer. Enter your email <img src=x onerror=alert(1)> https://hexaphp.medium.com/stored-xss-with-cloudflare-waf-bypass-420c99aba97b 11/8/25, 11:20 AM Stored XSS with Cloudflare WAF Bypass | by Aland Dishad (HexaPhp) | Medium Sorry, you have been blocked x Why have | been blocked? What can I do to resolve this? But this time, Cloudflare’s WAF blocked the request, showing a 403 error. So I knew I'd need to get creative if I wanted to bypass it. After trying a few different obfuscation techniques, I landed on this payload: <img src=OnErRor OnErRor=(alert)(“Aland_Dlshad__HexaPhp”)> https://hexaphp.medium.com/stored-xss-with-cloudflare-waf-bypass-420c99aba97b 3/8 11/8/25, 11:20 AM Stored XSS with Cloudflare WAF Bypass | by Aland Dishad (HexaPhp) | Medium To my surprise — it worked. No WAF block, and the alert popped clean when the stored input was rendered. Looks like the mixed casing and duplicated onerror attributes confused Cloudflare's WAF, allowing the payload to slip through. The backend didn't sanitize the data, so the browser just executed it. . Takeaway Cloudflare caught the obvious stuff — but it doesn’t matter how strong your WAF is if your backend blindly trusts user input. Stored XSS was possible because of poor output encoding, and the WAF was bypassed with minor tweaks. https://hexaphp.medium.com/stored-xss-with-cloudflare-waf-bypass-420c99aba97b 4/8 11/8/25,",
    "source": "writeup_1.pdf"
  },
  {
    "id": "writeup_1.pdf_2",
    "text": "11:20 AM Stored XSS with Cloudflare WAF Bypass | by Aland Dishad (HexaPhp) | Medium Cybersecurity Bug Hunting Bug Bounty Bugs Bugbounty Writeup re) Written by Aland Dishad (HexaPhp) 28 followers - 127 following Web Application Penetration Tester | Securing Web Applications | Certified #EWPTX #EJPT #CAP #CAPEN Responses (2) C) Write a response What are your thoughts? Aybora Unveren Sep7 Who would have thought they blindly trust WAF :) S) QQ treply Reply Hacker Write-Ups Sep7 If you don't mind. Bro | used this write-ups for my website where | gather bug bounty and hacking related write-ups. https://hexaphp.medium.com/stored-xss-with-cloudflare-waf-bypass-420c99aba97b 5/8 11/8/25, 11:20 AM Stored XSS with Cloudflare WAF Bypass | by Aland Dishad (HexaPhp) | Medium Website : https://hacker-writeups.github.io If there is any problem tell me | will delete the write-ups. Thank You for contributing. &) Qreply Reply More from Aland Dishad (HexaPhp) @ Aland Dishad (HexaPhp) How | Got a Four-Digit Bug Bounty From Grammarly ee | ed Sometimes, big bugs hide in the simplest places. While testing po Grammarly’s document upload feature, | noticed a tiny detail in... Oct31 W59 @1 ty (see all from Aland Dishad (HexePhp) ») Recommended from Medium https://hexaphp.medium.com/stored-xss-with-cloudflare-waf-bypass-420c99aba97b 6/8 11/8/25, 11:20 AM Stored",
    "source": "writeup_1.pdf"
  },
  {
    "id": "writeup_1.pdf_3",
    "text": "XSS with Cloudflare WAF Bypass | by Aland Dishad (HexaPhp) | Medium In InfoSec Write-ups by SIDDHANT SHUKLA One Click to All Basic Recon for Bug Bounty All Recon with One Click + Oct8 WE05 @5 yt @ Very Lazy Tech Mastering Subdomain Takeover: Step-by-Step Guide with Real Too... Link for the full article in the first comment + Oct30 2 @2 Cy Wigs ACH POISONING UNDERSTANDING THE BEAST @ Jerry Shah VJerry) HTML Injection - Return of the P2 Elevator Summary Oct31 Ws @1 ma e@ Abhishek meena © W& Web Cache Poisoning—Part 1: Understanding the Beast “If you can make the cache remember your payload, you control what everyone else... + Oct29 W106 py https://hexaphp.medium.com/stored-xss-with-cloudflare-waf-bypass-420c99aba97b 7/8 11/8/25, 11:20 AM is In JavaScript in Plain En... by Narendar Battula (n... | Used usedJS to Find 100+ Vulnerabilities—Here’s How “The JavaScript files told me everything—I just had to listen.” + Jul2z7 wea @1 me See more recommendations Stored XSS with Cloudflare WAF Bypass | by Aland Dishad (HexaPhp) | Medium ee Sa & Be nice insabat How i found account takeover in private bug bounty program of... email@gmail.com.burpcolab.com Assalam o alaikum for muslim brothers and hello for no... + Oct30",
    "source": "writeup_1.pdf"
  },
  {
    "id": "writeup_1.pdf_4",
    "text": "W95 @3 Cy https://hexaphp.medium.com/stored-xss-with-cloudflare-waf-bypass-420c99aba97b 8/8",
    "source": "writeup_1.pdf"
  }
]